tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_NETC_PORT.h
#define NETC_PORT_PRXDCRR0_IPFDR_MASK            (0x8U)
#define NETC_PORT_PRXDCRR0_IPFDR_SHIFT           (3U)
#define NETC_PORT_PRXDCRR0_IPFDR(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PRXDCRR0_IPFDR_SHIFT)) & NETC_PORT_PRXDCRR0_IPFDR_MASK)

#define NETC_PORT_PRXDCRR0_RPDR_MASK             (0x10U)
#define NETC_PORT_PRXDCRR0_RPDR_SHIFT            (4U)
#define NETC_PORT_PRXDCRR0_RPDR(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PRXDCRR0_RPDR_SHIFT)) & NETC_PORT_PRXDCRR0_RPDR_MASK)

#define NETC_PORT_PRXDCRR0_ISFDR_MASK            (0x20U)
#define NETC_PORT_PRXDCRR0_ISFDR_SHIFT           (5U)
#define NETC_PORT_PRXDCRR0_ISFDR(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PRXDCRR0_ISFDR_SHIFT)) & NETC_PORT_PRXDCRR0_ISFDR_MASK)

#define NETC_PORT_PRXDCRR0_SGCDR_MASK            (0x40U)
#define NETC_PORT_PRXDCRR0_SGCDR_SHIFT           (6U)
#define NETC_PORT_PRXDCRR0_SGCDR(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PRXDCRR0_SGCDR_SHIFT)) & NETC_PORT_PRXDCRR0_SGCDR_MASK)

#define NETC_PORT_PRXDCRR0_SGOEDR_MASK           (0x80U)
#define NETC_PORT_PRXDCRR0_SGOEDR_SHIFT          (7U)
#define NETC_PORT_PRXDCRR0_SGOEDR(x)             (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PRXDCRR0_SGOEDR_SHIFT)) & NETC_PORT_PRXDCRR0_SGOEDR_MASK)

#define NETC_PORT_PRXDCRR0_MSDUEDR_MASK          (0x100U)
#define NETC_PORT_PRXDCRR0_MSDUEDR_SHIFT         (8U)
#define NETC_PORT_PRXDCRR0_MSDUEDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PRXDCRR0_MSDUEDR_SHIFT)) & NETC_PORT_PRXDCRR0_MSDUEDR_MASK)

#define NETC_PORT_PRXDCRR0_FMMEDR_MASK           (0x200U)
#define NETC_PORT_PRXDCRR0_FMMEDR_SHIFT          (9U)
#define NETC_PORT_PRXDCRR0_FMMEDR(x)             (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PRXDCRR0_FMMEDR_SHIFT)) & NETC_PORT_PRXDCRR0_FMMEDR_MASK)

#define NETC_PORT_PRXDCRR0_CMDR_MASK             (0x400U)
#define NETC_PORT_PRXDCRR0_CMDR_SHIFT            (10U)
#define NETC_PORT_PRXDCRR0_CMDR(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PRXDCRR0_CMDR_SHIFT)) & NETC_PORT_PRXDCRR0_CMDR_MASK)

#define NETC_PORT_PRXDCRR0_ITEDR_MASK            (0x800U)
#define NETC_PORT_PRXDCRR0_ITEDR_SHIFT           (11U)
#define NETC_PORT_PRXDCRR0_ITEDR(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PRXDCRR0_ITEDR_SHIFT)) & NETC_PORT_PRXDCRR0_ITEDR_MASK)

#define NETC_PORT_PRXDCRR0_ECCEDR_MASK           (0x1000U)
#define NETC_PORT_PRXDCRR0_ECCEDR_SHIFT          (12U)
#define NETC_PORT_PRXDCRR0_ECCEDR(x)             (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PRXDCRR0_ECCEDR_SHIFT)) & NETC_PORT_PRXDCRR0_ECCEDR_MASK)

#define NETC_PORT_PRXDCRR0_SIFDR_MASK            (0x2000U)
#define NETC_PORT_PRXDCRR0_SIFDR_SHIFT           (13U)
#define NETC_PORT_PRXDCRR0_SIFDR(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PRXDCRR0_SIFDR_SHIFT)) & NETC_PORT_PRXDCRR0_SIFDR_MASK)

#define NETC_PORT_PRXDCRR0_L2DOSDR_MASK          (0x4000U)
#define NETC_PORT_PRXDCRR0_L2DOSDR_SHIFT         (14U)
#define NETC_PORT_PRXDCRR0_L2DOSDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PRXDCRR0_L2DOSDR_SHIFT)) & NETC_PORT_PRXDCRR0_L2DOSDR_MASK)

#define NETC_PORT_PRXDCRR0_NODESTDR_MASK         (0x20000U)
#define NETC_PORT_PRXDCRR0_NODESTDR_SHIFT        (17U)
/*! NODESTDR - No Destination Discard Reason */
#define NETC_PORT_PRXDCRR0_NODESTDR(x)           (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PRXDCRR0_NODESTDR_SHIFT)) & NETC_PORT_PRXDCRR0_NODESTDR_MASK)
/*! @} */

/*! @name PRXDCRR1 - Port Rx discard count reason register 1 */
/*! @{ */

#define NETC_PORT_PRXDCRR1_ENTRYID_MASK          (0xFFFFU)
#define NETC_PORT_PRXDCRR1_ENTRYID_SHIFT         (0U)
#define NETC_PORT_PRXDCRR1_ENTRYID(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PRXDCRR1_ENTRYID_SHIFT)) & NETC_PORT_PRXDCRR1_ENTRYID_MASK)

#define NETC_PORT_PRXDCRR1_TT_MASK               (0xF0000000U)
#define NETC_PORT_PRXDCRR1_TT_SHIFT              (28U)
#define NETC_PORT_PRXDCRR1_TT(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PRXDCRR1_TT_SHIFT)) & NETC_PORT_PRXDCRR1_TT_MASK)
/*! @} */

/*! @name PTXDCR - Port Tx discard count register */
/*! @{ */

#define NETC_PORT_PTXDCR_COUNT_MASK              (0xFFFFFFFFU)
#define NETC_PORT_PTXDCR_COUNT_SHIFT             (0U)
#define NETC_PORT_PTXDCR_COUNT(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTXDCR_COUNT_SHIFT)) & NETC_PORT_PTXDCR_COUNT_MASK)
/*! @} */

/*! @name PTXDCRR0 - Port Tx discard count reason register 0 */
/*! @{ */

#define NETC_PORT_PTXDCRR0_TXDISDR_MASK          (0x1U)
#define NETC_PORT_PTXDCRR0_TXDISDR_SHIFT         (0U)
#define NETC_PORT_PTXDCRR0_TXDISDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTXDCRR0_TXDISDR_SHIFT)) & NETC_PORT_PTXDCRR0_TXDISDR_MASK)

#define NETC_PORT_PTXDCRR0_ECCEDR_MASK           (0x2U)
#define NETC_PORT_PTXDCRR0_ECCEDR_SHIFT          (1U)
/*! ECCEDR - ECC Error Discard Reason */
#define NETC_PORT_PTXDCRR0_ECCEDR(x)             (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTXDCRR0_ECCEDR_SHIFT)) & NETC_PORT_PTXDCRR0_ECCEDR_MASK)

#define NETC_PORT_PTXDCRR0_PEDR_MASK             (0x4U)
#define NETC_PORT_PTXDCRR0_PEDR_SHIFT            (2U)
/*! PEDR - Parity Error Discard Reason */
#define NETC_PORT_PTXDCRR0_PEDR(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTXDCRR0_PEDR_SHIFT)) & NETC_PORT_PTXDCRR0_PEDR_MASK)

#define NETC_PORT_PTXDCRR0_TGSFTLDR_MASK         (0x10U)
#define NETC_PORT_PTXDCRR0_TGSFTLDR_SHIFT        (4U)
#define NETC_PORT_PTXDCRR0_TGSFTLDR(x)           (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTXDCRR0_TGSFTLDR_SHIFT)) & NETC_PORT_PTXDCRR0_TGSFTLDR_MASK)

#define NETC_PORT_PTXDCRR0_FMMDR_MASK            (0x20U)
#define NETC_PORT_PTXDCRR0_FMMDR_SHIFT           (5U)
#define NETC_PORT_PTXDCRR0_FMMDR(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTXDCRR0_FMMDR_SHIFT)) & NETC_PORT_PTXDCRR0_FMMDR_MASK)

#define NETC_PORT_PTXDCRR0_TXDISEDR_MASK         (0x40U)
#define NETC_PORT_PTXDCRR0_TXDISEDR_SHIFT        (6U)
#define NETC_PORT_PTXDCRR0_TXDISEDR(x)           (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTXDCRR0_TXDISEDR_SHIFT)) & NETC_PORT_PTXDCRR0_TXDISEDR_MASK)

