tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_NETC_PORT.h
/* The count of NETC_PORT_PTCCBSR1 */
#define NETC_PORT_PTCCBSR1_COUNT                 (8U)

/*! @name PBPMCR0 - Port buffer pool mapping configuration register 0 */
/*! @{ */

#define NETC_PORT_PBPMCR0_IPV0_INDEX_MASK        (0xFFU)
#define NETC_PORT_PBPMCR0_IPV0_INDEX_SHIFT       (0U)
#define NETC_PORT_PBPMCR0_IPV0_INDEX(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PBPMCR0_IPV0_INDEX_SHIFT)) & NETC_PORT_PBPMCR0_IPV0_INDEX_MASK)

#define NETC_PORT_PBPMCR0_IPV1_INDEX_MASK        (0xFF00U)
#define NETC_PORT_PBPMCR0_IPV1_INDEX_SHIFT       (8U)
#define NETC_PORT_PBPMCR0_IPV1_INDEX(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PBPMCR0_IPV1_INDEX_SHIFT)) & NETC_PORT_PBPMCR0_IPV1_INDEX_MASK)

#define NETC_PORT_PBPMCR0_IPV2_INDEX_MASK        (0xFF0000U)
#define NETC_PORT_PBPMCR0_IPV2_INDEX_SHIFT       (16U)
#define NETC_PORT_PBPMCR0_IPV2_INDEX(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PBPMCR0_IPV2_INDEX_SHIFT)) & NETC_PORT_PBPMCR0_IPV2_INDEX_MASK)

#define NETC_PORT_PBPMCR0_IPV3_INDEX_MASK        (0xFF000000U)
#define NETC_PORT_PBPMCR0_IPV3_INDEX_SHIFT       (24U)
#define NETC_PORT_PBPMCR0_IPV3_INDEX(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PBPMCR0_IPV3_INDEX_SHIFT)) & NETC_PORT_PBPMCR0_IPV3_INDEX_MASK)
/*! @} */

/*! @name PBPMCR1 - Port buffer pool mapping configuration register 1 */
/*! @{ */

#define NETC_PORT_PBPMCR1_IPV4_INDEX_MASK        (0xFFU)
#define NETC_PORT_PBPMCR1_IPV4_INDEX_SHIFT       (0U)
#define NETC_PORT_PBPMCR1_IPV4_INDEX(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PBPMCR1_IPV4_INDEX_SHIFT)) & NETC_PORT_PBPMCR1_IPV4_INDEX_MASK)

#define NETC_PORT_PBPMCR1_IPV5_INDEX_MASK        (0xFF00U)
#define NETC_PORT_PBPMCR1_IPV5_INDEX_SHIFT       (8U)
#define NETC_PORT_PBPMCR1_IPV5_INDEX(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PBPMCR1_IPV5_INDEX_SHIFT)) & NETC_PORT_PBPMCR1_IPV5_INDEX_MASK)

#define NETC_PORT_PBPMCR1_IPV6_INDEX_MASK        (0xFF0000U)
#define NETC_PORT_PBPMCR1_IPV6_INDEX_SHIFT       (16U)
#define NETC_PORT_PBPMCR1_IPV6_INDEX(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PBPMCR1_IPV6_INDEX_SHIFT)) & NETC_PORT_PBPMCR1_IPV6_INDEX_MASK)

#define NETC_PORT_PBPMCR1_IPV7_INDEX_MASK        (0xFF000000U)
#define NETC_PORT_PBPMCR1_IPV7_INDEX_SHIFT       (24U)
#define NETC_PORT_PBPMCR1_IPV7_INDEX(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PBPMCR1_IPV7_INDEX_SHIFT)) & NETC_PORT_PBPMCR1_IPV7_INDEX_MASK)
/*! @} */

/*! @name PPCPDEIMR - Port PCP DEI mapping register */
/*! @{ */

#define NETC_PORT_PPCPDEIMR_IPCPMP_MASK          (0xFU)
#define NETC_PORT_PPCPDEIMR_IPCPMP_SHIFT         (0U)
#define NETC_PORT_PPCPDEIMR_IPCPMP(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PPCPDEIMR_IPCPMP_SHIFT)) & NETC_PORT_PPCPDEIMR_IPCPMP_MASK)

#define NETC_PORT_PPCPDEIMR_IPCPMPV_MASK         (0x80U)
#define NETC_PORT_PPCPDEIMR_IPCPMPV_SHIFT        (7U)
/*! IPCPMPV
 *  0b0..Ingress PCP to PCP Mapping Profile is not valid.
 *  0b1..Ingress frame modification of outer VLAN tag's PCP value is mapped to a new value based on IPCPMP instance
 */
#define NETC_PORT_PPCPDEIMR_IPCPMPV(x)           (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PPCPDEIMR_IPCPMPV_SHIFT)) & NETC_PORT_PPCPDEIMR_IPCPMPV_MASK)

#define NETC_PORT_PPCPDEIMR_EPCPMP_MASK          (0xF00U)
#define NETC_PORT_PPCPDEIMR_EPCPMP_SHIFT         (8U)
#define NETC_PORT_PPCPDEIMR_EPCPMP(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PPCPDEIMR_EPCPMP_SHIFT)) & NETC_PORT_PPCPDEIMR_EPCPMP_MASK)

#define NETC_PORT_PPCPDEIMR_EPCPMPV_MASK         (0x8000U)
#define NETC_PORT_PPCPDEIMR_EPCPMPV_SHIFT        (15U)
/*! EPCPMPV
 *  0b0..Egress PCP to PCP Mapping Profile is not valid.
 *  0b1..Egress frame modification of outer VLAN tag's PCP value is mapped to a new value based on EPCPMP instance.
 */
#define NETC_PORT_PPCPDEIMR_EPCPMPV(x)           (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PPCPDEIMR_EPCPMPV_SHIFT)) & NETC_PORT_PPCPDEIMR_EPCPMPV_MASK)

#define NETC_PORT_PPCPDEIMR_DR0DEI_MASK          (0x10000U)
#define NETC_PORT_PPCPDEIMR_DR0DEI_SHIFT         (16U)
#define NETC_PORT_PPCPDEIMR_DR0DEI(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PPCPDEIMR_DR0DEI_SHIFT)) & NETC_PORT_PPCPDEIMR_DR0DEI_MASK)

#define NETC_PORT_PPCPDEIMR_DR1DEI_MASK          (0x20000U)
#define NETC_PORT_PPCPDEIMR_DR1DEI_SHIFT         (17U)
#define NETC_PORT_PPCPDEIMR_DR1DEI(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PPCPDEIMR_DR1DEI_SHIFT)) & NETC_PORT_PPCPDEIMR_DR1DEI_MASK)

#define NETC_PORT_PPCPDEIMR_DR2DEI_MASK          (0x40000U)
#define NETC_PORT_PPCPDEIMR_DR2DEI_SHIFT         (18U)
#define NETC_PORT_PPCPDEIMR_DR2DEI(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PPCPDEIMR_DR2DEI_SHIFT)) & NETC_PORT_PPCPDEIMR_DR2DEI_MASK)

#define NETC_PORT_PPCPDEIMR_DR3DEI_MASK          (0x80000U)
#define NETC_PORT_PPCPDEIMR_DR3DEI_SHIFT         (19U)
#define NETC_PORT_PPCPDEIMR_DR3DEI(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PPCPDEIMR_DR3DEI_SHIFT)) & NETC_PORT_PPCPDEIMR_DR3DEI_MASK)

#define NETC_PORT_PPCPDEIMR_DRME_MASK            (0x100000U)
#define NETC_PORT_PPCPDEIMR_DRME_SHIFT           (20U)
/*! DRME
 *  0b0..Preserve the DEI value in the outer VLAN.
 *  0b1..Update DEI value in the outer VLAN based on DRnDEI field.
 */
#define NETC_PORT_PPCPDEIMR_DRME(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PPCPDEIMR_DRME_SHIFT)) & NETC_PORT_PPCPDEIMR_DRME_MASK)
/*! @} */

/*! @name PMCR - Port mirror configuration register */
/*! @{ */

#define NETC_PORT_PMCR_IMIRE_MASK                (0x1U)
#define NETC_PORT_PMCR_IMIRE_SHIFT               (0U)
#define NETC_PORT_PMCR_IMIRE(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PMCR_IMIRE_SHIFT)) & NETC_PORT_PMCR_IMIRE_MASK)
/*! @} */

/*! @name PCTFCR - Port cut through forwarding configuration register */
/*! @{ */

#define NETC_PORT_PCTFCR_ICTS_MASK               (0x1U)
#define NETC_PORT_PCTFCR_ICTS_SHIFT              (0U)
#define NETC_PORT_PCTFCR_ICTS(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PCTFCR_ICTS_SHIFT)) & NETC_PORT_PCTFCR_ICTS_MASK)

#define NETC_PORT_PCTFCR_ECTS_MASK               (0x2U)
#define NETC_PORT_PCTFCR_ECTS_SHIFT              (1U)
#define NETC_PORT_PCTFCR_ECTS(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PCTFCR_ECTS_SHIFT)) & NETC_PORT_PCTFCR_ECTS_MASK)
/*! @} */

/*! @name PLANIDCR - Port LANID configuration register */
/*! @{ */

