tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_NETC_PORT.h
#define NETC_PORT_BPSTGSR_STG_STATE13_MASK       (0xC000000U)
#define NETC_PORT_BPSTGSR_STG_STATE13_SHIFT      (26U)
#define NETC_PORT_BPSTGSR_STG_STATE13(x)         (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE13_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE13_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE14_MASK       (0x30000000U)
#define NETC_PORT_BPSTGSR_STG_STATE14_SHIFT      (28U)
#define NETC_PORT_BPSTGSR_STG_STATE14(x)         (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE14_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE14_MASK)

#define NETC_PORT_BPSTGSR_STG_STATE15_MASK       (0xC0000000U)
#define NETC_PORT_BPSTGSR_STG_STATE15_SHIFT      (30U)
#define NETC_PORT_BPSTGSR_STG_STATE15(x)         (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSTGSR_STG_STATE15_SHIFT)) & NETC_PORT_BPSTGSR_STG_STATE15_MASK)
/*! @} */

/*! @name BPSCR0 - Bridge port storm control register 0 */
/*! @{ */

#define NETC_PORT_BPSCR0_UUCASTRPEID_MASK        (0xFFFU)
#define NETC_PORT_BPSCR0_UUCASTRPEID_SHIFT       (0U)
#define NETC_PORT_BPSCR0_UUCASTRPEID(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSCR0_UUCASTRPEID_SHIFT)) & NETC_PORT_BPSCR0_UUCASTRPEID_MASK)

#define NETC_PORT_BPSCR0_BCASTRPEID_MASK         (0xFFF0000U)
#define NETC_PORT_BPSCR0_BCASTRPEID_SHIFT        (16U)
#define NETC_PORT_BPSCR0_BCASTRPEID(x)           (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSCR0_BCASTRPEID_SHIFT)) & NETC_PORT_BPSCR0_BCASTRPEID_MASK)
/*! @} */

/*! @name BPSCR1 - Bridge port storm control register 1 */
/*! @{ */

#define NETC_PORT_BPSCR1_MCASTRPEID_MASK         (0xFFFU)
#define NETC_PORT_BPSCR1_MCASTRPEID_SHIFT        (0U)
#define NETC_PORT_BPSCR1_MCASTRPEID(x)           (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSCR1_MCASTRPEID_SHIFT)) & NETC_PORT_BPSCR1_MCASTRPEID_MASK)

#define NETC_PORT_BPSCR1_UMCASTRPEID_MASK        (0xFFF0000U)
#define NETC_PORT_BPSCR1_UMCASTRPEID_SHIFT       (16U)
#define NETC_PORT_BPSCR1_UMCASTRPEID(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPSCR1_UMCASTRPEID_SHIFT)) & NETC_PORT_BPSCR1_UMCASTRPEID_MASK)
/*! @} */

/*! @name BPOR - Bridge port operational register */
/*! @{ */

#define NETC_PORT_BPOR_NUM_DYN_MASK              (0xFFFFU)
#define NETC_PORT_BPOR_NUM_DYN_SHIFT             (0U)
#define NETC_PORT_BPOR_NUM_DYN(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPOR_NUM_DYN_SHIFT)) & NETC_PORT_BPOR_NUM_DYN_MASK)
/*! @} */

/*! @name BPDCR - Bridge port discard count register */
/*! @{ */

#define NETC_PORT_BPDCR_COUNT_MASK               (0xFFFFFFFFU)
#define NETC_PORT_BPDCR_COUNT_SHIFT              (0U)
#define NETC_PORT_BPDCR_COUNT(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDCR_COUNT_SHIFT)) & NETC_PORT_BPDCR_COUNT_MASK)
/*! @} */

/*! @name BPDCRR0 - Bridge port discard count reason register 0 */
/*! @{ */

#define NETC_PORT_BPDCRR0_BPACDR_MASK            (0x1U)
#define NETC_PORT_BPDCRR0_BPACDR_SHIFT           (0U)
#define NETC_PORT_BPDCRR0_BPACDR(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDCRR0_BPACDR_SHIFT)) & NETC_PORT_BPDCRR0_BPACDR_MASK)

#define NETC_PORT_BPDCRR0_ISTGSDR_MASK           (0x2U)
#define NETC_PORT_BPDCRR0_ISTGSDR_SHIFT          (1U)
#define NETC_PORT_BPDCRR0_ISTGSDR(x)             (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDCRR0_ISTGSDR_SHIFT)) & NETC_PORT_BPDCRR0_ISTGSDR_MASK)

#define NETC_PORT_BPDCRR0_BPVFLTDR_MASK          (0x4U)
#define NETC_PORT_BPDCRR0_BPVFLTDR_SHIFT         (2U)
#define NETC_PORT_BPDCRR0_BPVFLTDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDCRR0_BPVFLTDR_SHIFT)) & NETC_PORT_BPDCRR0_BPVFLTDR_MASK)

#define NETC_PORT_BPDCRR0_MACLNFDR_MASK          (0x8U)
#define NETC_PORT_BPDCRR0_MACLNFDR_SHIFT         (3U)
#define NETC_PORT_BPDCRR0_MACLNFDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDCRR0_MACLNFDR_SHIFT)) & NETC_PORT_BPDCRR0_MACLNFDR_MASK)

#define NETC_PORT_BPDCRR0_STAMVDDR_MASK          (0x80U)
#define NETC_PORT_BPDCRR0_STAMVDDR_SHIFT         (7U)
#define NETC_PORT_BPDCRR0_STAMVDDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDCRR0_STAMVDDR_SHIFT)) & NETC_PORT_BPDCRR0_STAMVDDR_MASK)

#define NETC_PORT_BPDCRR0_MACFDDDR_MASK          (0x100U)
#define NETC_PORT_BPDCRR0_MACFDDDR_SHIFT         (8U)
#define NETC_PORT_BPDCRR0_MACFDDDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDCRR0_MACFDDDR_SHIFT)) & NETC_PORT_BPDCRR0_MACFDDDR_MASK)

#define NETC_PORT_BPDCRR0_NODESTDR_MASK          (0x200U)
#define NETC_PORT_BPDCRR0_NODESTDR_SHIFT         (9U)
#define NETC_PORT_BPDCRR0_NODESTDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDCRR0_NODESTDR_SHIFT)) & NETC_PORT_BPDCRR0_NODESTDR_MASK)

#define NETC_PORT_BPDCRR0_IPMFDR_MASK            (0x400U)
#define NETC_PORT_BPDCRR0_IPMFDR_SHIFT           (10U)
#define NETC_PORT_BPDCRR0_IPMFDR(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDCRR0_IPMFDR_SHIFT)) & NETC_PORT_BPDCRR0_IPMFDR_MASK)

#define NETC_PORT_BPDCRR0_UFMMDR_MASK            (0x800U)
#define NETC_PORT_BPDCRR0_UFMMDR_SHIFT           (11U)
#define NETC_PORT_BPDCRR0_UFMMDR(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDCRR0_UFMMDR_SHIFT)) & NETC_PORT_BPDCRR0_UFMMDR_MASK)

#define NETC_PORT_BPDCRR0_MISCDR_MASK            (0x1000U)
#define NETC_PORT_BPDCRR0_MISCDR_SHIFT           (12U)
#define NETC_PORT_BPDCRR0_MISCDR(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDCRR0_MISCDR_SHIFT)) & NETC_PORT_BPDCRR0_MISCDR_MASK)

#define NETC_PORT_BPDCRR0_STRMCTRLDR_MASK        (0x2000U)
#define NETC_PORT_BPDCRR0_STRMCTRLDR_SHIFT       (13U)
/*! STRMCTRLDR - Discard due to Storm Control Policer Discard Reason */
#define NETC_PORT_BPDCRR0_STRMCTRLDR(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDCRR0_STRMCTRLDR_SHIFT)) & NETC_PORT_BPDCRR0_STRMCTRLDR_MASK)
/*! @} */

/*! @name BPDCRR1 - Bridge port discard count reason register 1 */
/*! @{ */

#define NETC_PORT_BPDCRR1_ENTRYID_MASK           (0x7FFFFFFU)
#define NETC_PORT_BPDCRR1_ENTRYID_SHIFT          (0U)
#define NETC_PORT_BPDCRR1_ENTRYID(x)             (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDCRR1_ENTRYID_SHIFT)) & NETC_PORT_BPDCRR1_ENTRYID_MASK)

#define NETC_PORT_BPDCRR1_TT_MASK                (0xF0000000U)
#define NETC_PORT_BPDCRR1_TT_SHIFT               (28U)
#define NETC_PORT_BPDCRR1_TT(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDCRR1_TT_SHIFT)) & NETC_PORT_BPDCRR1_TT_MASK)
/*! @} */

/*! @name BPMLFSR - Bridge port MAC learning failure status register */
/*! @{ */

